In [2]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [4]:
df = pd.read_csv('student.csv')

In [5]:
#five function

df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [6]:
df.tail()

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [7]:
df.iloc[1:4]

   id        name  class  mark  gender
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female

In [12]:
df.dtypes

id         int64
name      object
class     object
mark       int64
gender    object
dtype: object

In [14]:
df.loc[0:1]

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60.

In [51]:
data = {
    'values':[10,20,30]
}

In [53]:
df1=pd.DataFrame(data)

In [54]:
df1.head()

   values
0      10
1      20
2      30

In [74]:
num=df['value']

In [83]:
num1=list(num)

In [84]:
num1

[10, 20, 30]

In [85]:
def sum(val):
    ans =0
    for i in val:
        ans = ans +i

    return ans

In [86]:
sum(num1)

60


Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [6]:
data={
    'Test':['pw','skills','krish'],
    
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

     Test
0      pw
1  skills
2   krish

In [11]:
df['word_count']=df['Test'].apply(lambda a: len(a))

In [12]:
df

     Test  word_count
0      pw           2
1  skills           6
2   krish           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [82]:
data = {
    "student":['hone','bone','jone'],
    'marks':[10,20,30]
}

In [83]:
df1=pd.DataFrame(data)

In [84]:
df1.size #it gives us the total number or rows and columb

6

In [85]:
df1.shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel() #This is used to read the execl file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6  10   4

3  2   3   5

4  9   1   2
Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [195]:
df = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,10,3,1],'C':[1,7,4,5,2]})

In [196]:
df[df['B'] <10]

   A  B  C
0  3  5  1
1  8  2  7
3  2  3  5
4  9  1  2

In [197]:
df[df['A'] > 5 ]

   A   B  C
1  8   2  7
2  6  10  4
4  9   1  2

In [198]:
df1=df[df['A'] > 5 ]

In [199]:
df1

   A   B  C
1  8   2  7
2  6  10  4
4  9   1  2

In [203]:
final_data=df1[df1['B']<10]

In [204]:
final_data

   A  B  C
1  8  2  7
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column.

In [154]:
df = pd.DataFrame({'Values': [20,30,40,8,39,93]})

In [155]:
df.describe()

          Values
count   6.000000
mean   38.333333
std    29.384803
min     8.000000
25%    22.500000
50%    34.500000
75%    39.750000
max    93.000000

In [156]:
df.mean()

Values    38.333333
dtype: float64

In [157]:
df.median()

Values    34.5
dtype: float64

In [158]:
df.std()

Values    29.384803
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day.



Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

In [215]:
df=pd.DataFrame({'Date':pd.date_range('2023-01-01','2023-01-05')})

In [223]:
df['Weekday'] = df['Date'].dt.day_name()

In [224]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python 
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [5]:
date = pd.date_range(start='2022-12-01', end='2023-02-28')
df = pd.DataFrame(date,columns=['Date'])
df

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [10]:
start='2023-01-01'
end= '2023-01-31'

filter_date=(df['Date']>start) & (df['Date']<end)

In [17]:
df.loc[filter_date]

         Date
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30


Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported?

Ans; panda libary